Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CLD1G.svd
            <register>
               <name>OVR2CHDR</name>
               <description>Overlay 2 Channel Disable Register</description>
               <addressOffset>0x00000244</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CHSR</name>
               <description>Overlay 2 Channel Status Register</description>
               <addressOffset>0x00000248</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IER</name>
               <description>Overlay 2 Interrupt Enable Register</description>
               <addressOffset>0x0000024C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IDR</name>
               <description>Overlay 2 Interrupt Disable Register</description>
               <addressOffset>0x00000250</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IMR</name>
               <description>Overlay 2 Interrupt Mask Register</description>
               <addressOffset>0x00000254</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2ISR</name>
               <description>Overlay 2 Interrupt Status Register</description>
               <addressOffset>0x00000258</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Detected</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2HEAD</name>
               <description>Overlay 2 DMA Head Register</description>
               <addressOffset>0x0000025C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2ADDR</name>
               <description>Overlay 2 DMA Address Register</description>
               <addressOffset>0x00000260</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DMA Transfer Overlay 2 Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CTRL</name>
               <description>Overlay 2 DMA Control Register</description>
               <addressOffset>0x00000264</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFETCH</name>
                     <description>Lookup Table Fetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2NEXT</name>
               <description>Overlay 2 DMA Next Register</description>
               <addressOffset>0x00000268</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG0</name>
               <description>Overlay 2 Configuration Register 0</description>
               <addressOffset>0x0000026C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BLEN</name>
                     <description>AHB Burst Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BLENSelect</name>
                        <enumeratedValue>
                           <name>AHB_SINGLE</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR4</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR8</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR16</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLBO</name>
                     <description>Defined Length Burst Only For Channel Bus Transaction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROTDIS</name>
                     <description>Hardware Rotation Optimization Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKDIS</name>
                     <description>Hardware Rotation Lock Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG1</name>
               <description>Overlay 2 Configuration Register 1</description>
               <addressOffset>0x00000270</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLUTEN</name>
                     <description>Color Lookup Table Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGBMODE</name>
                     <description>RGB Mode Input Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>RGBMODESelect</name>
                        <enumeratedValue>
                           <name>_12BPP_RGB_444</name>
                           <description>12 bpp RGB 444</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_ARGB_4444</name>
                           <description>16 bpp ARGB 4444</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGBA_4444</name>
                           <description>16 bpp RGBA 4444</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGB_565</name>
                           <description>16 bpp RGB 565</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_TRGB_1555</name>
                           <description>16 bpp TRGB 1555</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666</name>
                           <description>18 bpp RGB 666</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666PACKED</name>
                           <description>18 bpp RGB 666 PACKED</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_1666</name>
                           <description>19 bpp TRGB 1666</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_PACKED</name>
                           <description>19 bpp TRGB 1666 PACKED</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888</name>
                           <description>24 bpp RGB 888</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888_PACKED</name>
                           <description>24 bpp RGB 888 PACKED</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_25BPP_TRGB_1888</name>
                           <description>25 bpp TRGB 1888</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_ARGB_8888</name>
                           <description>32 bpp ARGB 8888</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_RGBA_8888</name>
                           <description>32 bpp RGBA 8888</description>
                           <value>0xD</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLUTMODE</name>
                     <description>Color Lookup Table Mode Input Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CLUTMODESelect</name>
                        <enumeratedValue>
                           <name>CLUT_1BPP</name>
                           <description>Color Lookup Table mode set to 1 bit per pixel</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_2BPP</name>
                           <description>Color Lookup Table mode set to 2 bits per pixel</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_4BPP</name>
                           <description>Color Lookup Table mode set to 4 bits per pixel</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_8BPP</name>
                           <description>Color Lookup Table mode set to 8 bits per pixel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG2</name>
               <description>Overlay 2 Configuration Register 2</description>
               <addressOffset>0x00000274</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XPOS</name>
                     <description>Horizontal Window Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YPOS</name>
                     <description>Vertical Window Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG3</name>
               <description>Overlay 2 Configuration Register 3</description>
               <addressOffset>0x00000278</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XSIZE</name>
                     <description>Horizontal Window Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YSIZE</name>
                     <description>Vertical Window Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG4</name>
               <description>Overlay 2 Configuration Register 4</description>
               <addressOffset>0x0000027C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XSTRIDE</name>
                     <description>Horizontal Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
