Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CLD1G.svd
            <register>
               <name>AUDIO_PLL1</name>
               <description>Audio PLL Register 1</description>
               <addressOffset>0x0150</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FRACR</name>
                     <description>Fractional Loop Divider Setting</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Divider Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DIVSelect</name>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QDAUDIO</name>
                     <description>Output Divider Ratio for Pad Clock</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>44038G</version>
         <description>Peripheral Touch Controller</description>
         <groupName>PTC</groupName>
         <prependToName>PTC_</prependToName>
         <baseAddress>0xFC060000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x36</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>58</value>
         </interrupt>
         <registers>
            <register>
               <name>CMD</name>
               <description>PTC Command Register</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Host Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>NO_ACTION</name>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Waits for ongoing execution to complete, then stops.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REST</name>
                           <description>Stops and resets</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>Stops without waiting for ongoing execution to complete.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>Starts execution (from stopped state)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>PTC Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>NOTIFY0</name>
                     <description>Notification to the Firmware</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ0</name>
                     <description>IRQ0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ1</name>
                     <description>IRQ1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ2</name>
                     <description>IRQ2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ3</name>
                     <description>IRQ3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IED</name>
               <description>PTC Enable Register</description>
               <addressOffset>0x35</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IER0</name>
                     <description>IER0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER1</name>
                     <description>IER1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER2</name>
                     <description>IER2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER3</name>
                     <description>IER3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
